# GetObject

## Description
Function GetObject returns a handle to a named object. If the name does not exist, NIL is returned.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION GetObject(name : STRING) : HANDLE;
```

```python

def vs.GetObject(name):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|Object name.|

## Version
Availability: from MiniCAD
## Category
* Object Names